import { clsx, type ClassValue } from "clsx"
import { twMerge } from "tailwind-merge"

export function cn(...inputs: ClassValue[]) {
  return twMerge(clsx(inputs))
}
export const keyToFinger: Record<string, number> = {
  // Row 0
  '%': 0, '-': 0, '+': 0, 'ๅ': 0,
  '๑': 1, '/': 1,
  '๒': 2, '_': 2,
  '๓': 3, 'ภ': 3, '๔': 3, 'ถ': 3,
  'ู': 6, 'ุ': 6, '฿': 6, 'ึ': 6,
  '๕': 7, 'ค': 7,
  '๖': 8, 'ต': 8,
  '๗': 9, 'จ': 9, '๘': 9, 'ข': 9, '๙': 9, 'ช': 9,

  // Row 1
  '๐': 0, 'ๆ': 0,
  '"': 1, 'ไ': 1,
  'ฎ': 2, 'ำ': 2,
  'ฑ': 3, 'พ': 3, 'ธ': 3, 'ะ': 3,
  'ํ': 6, 'ั': 6, '๊': 6, 'ี': 6,
  'ณ': 7, 'ร': 7,
  'ฯ': 8, 'น': 8,
  'ญ': 9, 'ย': 9, 'ฐ': 9, 'บ': 9, ',': 9, 'ล': 9, 'ฅ': 9, 'ฃ': 9,

  // Row 2
  'ฤ': 0, 'ฟ': 0,
  'ฆ': 1, 'ห': 1,
  'ฏ': 2, 'ก': 2,
  'โ': 3, 'ด': 3, 'ฌ': 3, 'เ': 3,
  '็': 6, '้': 6, '๋': 6, '่': 6,
  'ษ': 7, 'า': 7,
  'ศ': 8, 'ส': 8,
  'ซ': 9, 'ว': 9, '.': 9, 'ง': 9,

  // Row 3
  '(': 0, 'ผ': 0,
  ')': 1, 'ป': 1,
  'ฉ': 2, 'แ': 2,
  'ฮ': 3, 'อ': 3, 'ฺ': 3, 'ิ': 3,
  '์': 6, 'ื': 6, '?': 6, 'ท': 6,
  'ฒ': 7, 'ม': 7,
  'ฬ': 8, 'ใ': 8,
  'ฦ': 9, 'ฝ': 9,

  // Spacebar
  ' ': 4
};